In [4]:
try:
    file= open ('pandas.csv','x')
    file.close()
except:
    print('the file is already there.')

In [8]:
import pandas as pd
df=pd.read_csv('pandas.csv')
df

   sn     name  age   add       phone
0   1      ram   23   ktm  9867588989
1   2     hari   24   bkt  9866554433
2   3   manish   45   dkt  9848556677
3   4  krishna   34  btwl  9844898928
4   5   ghaman   33   kkt  9877676768

In [9]:
df.head(3)

   sn    name  age  add       phone
0   1     ram   23  ktm  9867588989
1   2    hari   24  bkt  9866554433
2   3  manish   45  dkt  9848556677

In [11]:
df.tail(3)

   sn     name  age   add       phone
2   3   manish   45   dkt  9848556677
3   4  krishna   34  btwl  9844898928
4   5   ghaman   33   kkt  9877676768

In [12]:
import pandas as pd
df=pd.read_csv('pandas.csv',index_col='sn')
df

       name  age   add       phone
sn
1       ram   23   ktm  9867588989
2      hari   24   bkt  9866554433
3    manish   45   dkt  9848556677
4   krishna   34  btwl  9844898928
5    ghaman   33   kkt  9877676768

In [15]:
import pandas as pd
df=pd.read_csv('pandas.csv',index_col='sn',usecols =['sn','name','age'])
df

       name  age
sn
1       ram   23
2      hari   24
3    manish   45
4   krishna   34
5    ghaman   33

In [18]:
import pandas as pd
df=pd.read_csv('pandas.csv',index_col='sn')
df.iloc[0:3,0:3]

      name  age  add
sn
1      ram   23  ktm
2     hari   24  bkt
3   manish   45  dkt

In [36]:
import pandas as pd
df=pd.read_csv('pandas.csv',index_col='name')
df.loc['ram':'manish']

        sn  age  add       phone
name
ram      1   23  ktm  9867588989
hari     2   24  bkt  9866554433
manish   3   45  dkt  9848556677

In [28]:
import pandas as pd
df=pd.read_csv('pandas.csv',index_col='sn')
df['add']=='ktm'

sn
1     True
2    False
3    False
4    False
5    False
Name: add, dtype: bool

In [37]:
import pandas as pd
df=pd.read_csv('pandas.csv',index_col='sn')
df[df['add']=='ktm']

   name  age  add       phone
sn
1   ram   23  ktm  9867588989

In [3]:
import pandas as pd
df=pd.read_csv('pandas.csv',index_col='sn')
df[(df['add']=='ktm') |(df['phone']==9867588989)]

   name  age  add       phone
sn
1   ram   23  ktm  9867588989

In [7]:
import pandas as pd
data={'name':['ram','shyam','hari'],
     'age':[22,34,55] ,
      'add':['ktm','bkt','lpr']}
df=pd.DataFrame(data)
df.to_csv('datas.csv')
df

    name  age  add
0    ram   22  ktm
1  shyam   34  bkt
2   hari   55  lpr

In [10]:
df=pd.read_csv('datas.csv',index_col='sn')
df

     name  age  add
sn
0     ram   22  ktm
1   shyam   34  bkt
2    hari   55  lpr

In [14]:
import csv
data=[[1,'sandesh',45,'ktm'],[2,'subin',23,'bkt'],[3,'neelam',25,'mng']]
file=open('datas1.csv','w')
x=csv.writer(file)
for i in data:
         x.writerow(i)
file.close()

In [25]:
import csv
csv_columns=['name','age','add']
dict=[{'name':'rakesh','age':24,'add':'ktm'},{'name':'ramesh','age':44,'add':'dkt'}]

csvfile=open('datas1.csv','w')
writer=csv.DictWriter(csvfile, fieldnames=csv_columns)
writer.writeheader()
for data in dict:
     writer.writerow(data)
csvfile.close()

In [29]:
import csv
csvfile = open('datas1.csv')
reader=csv.DictReader(csvfile)
for row in reader:
     print(row)

{'name': 'rakesh', 'age': '24', 'add': 'ktm'}
{'name': 'ramesh', 'age': '44', 'add': 'dkt'}

In [40]:
import pandas as pd
df=pd.read_csv('pandas.csv',index_col='add')
df.drop(['age'],axis=1)

      sn     name       phone
add
ktm    1      ram  9867588989
bkt    2     hari  9866554433
dkt    3   manish  9848556677
btwl   4  krishna  9844898928
kkt    5   ghaman  9877676768